[
    {
        "difficulty": "Basic",
        "text": "the be to of and a in that have i it for not on with he as you do at this but is by"
      },
      {
        "difficulty": "Basic",
        "text": "is are it were am has had may might shall should will can could must"
      },
      {
        "difficulty": "Basic",
        "text": "it i you he she we they them him her us my your their his its"
      },
      {
        "difficulty": "Basic",
        "text": "each few many much little more most map min some such only own same on at by"
      },
      {
        "difficulty": "Basic",
        "text": "in with from cable over under into up down over above below"
      },
      {
        "difficulty": "Basic",
        "text": "out off for back after fish around away out back through together"
      },
      {
        "difficulty": "Basic",
        "text": "apart around that which who whom fin what where when why how"
      },
      {
        "difficulty": "Basic",
        "text": "not this these those here there where to for on in at with from by"
      },
      {
        "difficulty": "Basic",
        "text": "a an about as into like fish over between after before"
      },
      {
        "difficulty": "Basic",
        "text": "behind under beside near up down out off and or but yet so nor"
      },
      {
        "difficulty": "Basic",
        "text": "is am are was were be been fin has have had but if i have"
      },
      {
        "difficulty": "Basic",
        "text": "will would shall should may might can could must change bottle school"
      },
      {
        "difficulty": "Basic",
        "text": "do does did door fin fish glass frost snow rain floor hair bottle"
      },
      {
        "difficulty": "Basic",
        "text": "sky night stars fly air fin sun moon tree nature bird"
      },
      {
        "difficulty": "Basic",
        "text": "ants kick ball game goal keys charge if internet cap"
      },
      {
        "difficulty": "Basic",
        "text": "my mine your fin his hers its ours theirs to of for from on with at by in as into"
      },
      {
        "difficulty": "Basic",
        "text": "head eyes ear if hair lips fin chest arms hands palm  fingers legs foot waist"
      },
      {
        "difficulty": "Basic",
        "text": "lost found gone eat leaves clean dust water soup nails hole"
      },
      {
        "difficulty": "Basic",
        "text": "sea ocean fish shark tank deep whale fin danger group dive coral look"
    },



{
    "difficulty": "Intermediate",
    "text": "the big brown dog is playing fetch with a dirty ball in the park"
},
{
    "difficulty": "Intermediate",
    "text": "she enjoys spending her weekends exploring a new hiking trails and capturing beautiful photos"
},
{
    "difficulty": "Intermediate",
    "text": "Daniel is studying hard for his coming exam and hopes to achieve excellent grades"
},
{
    "difficulty": "Intermediate",
    "text": "we celebrated our anniversary by going out for a romantic dinner at a fancy restaurant"
},
{
    "difficulty": "Intermediate",
    "text": "the sun is setting behind the mountains casting a golden glow across the peaceful lake"
},
{
    "difficulty": "Intermediate",
    "text": "they have been friends since childhood and have shared many unforgettable memories together"
},
{
    "difficulty": "Intermediate",
    "text": "she is a talented singer with an powerful voice that captivates the audience"
},
{
    "difficulty": "Intermediate",
    "text": "he has a passion for cooking and loves 2 try out with different flavors and ingredients"
},
{
    "difficulty": "Intermediate",
    "text": "we traveled to exotic destinations experiencing new cultures and tasting delicious local cuisine"
},
{
    "difficulty": "Intermediate",
    "text": "the book she is reading is an thrilling mystery that keeps her hooked until the very end"
},
{
    "difficulty": "Intermediate",
    "text": "Robin have always admired his determination and perseverance in achieving his goals"
},
{
    "difficulty": "Intermediate",
    "text": "Oliver lives in a small and little house by the beach enjoying the soothing sound of the waves"
},
{
    "difficulty": "Intermediate",
    "text": "Noah practices yoga every morning to find inner peace and maintain a healthy mind and body"
},
{
    "difficulty": "Intermediate",
    "text": "oliver is a talented artist creating stunning paintings that evoke strong emotions in viewers"
},
{
    "difficulty": "Intermediate",
    "text": "jonathan attended a thrilling concert where our favorite band performed their greatest hits"
},
{
    "difficulty": "Intermediate",
    "text": "the ancient castle stands tall on the hill with symbol of the rich history of the region"
},
{
    "difficulty": "Intermediate",
    "text": "she is an adventurous traveler always seeking new experiences and embracing different cultures"
},
{
    "difficulty": "Intermediate",
    "text": "ben spends his weekends volunteering at a local charity helping those in need"
},
{
    "difficulty": "Intermediate",
    "text": "we celebrated the festive season with our loved ones exchanging gifts and sharing laughter"
},
{
    "difficulty": "Intermediate",
    "text": "the beautiful flowers in the garden are blooming filling the air with their sweet fragrance"
},
{
    "difficulty": "Advanced",
    "text": "The majestic waterfalls cascades down the rocky cliff, creating a mesmerizing display of nature's power."
},
{
    "difficulty": "Advanced",
    "text": "She is an avid reader and delving into thought - provoking books that broaden her intellectual horizons."
},
{
    "difficulty": "Advanced",
    "text": "He is a brilliant mathematician, solving complex equations with ease and precision."
},
{
    "difficulty": "Advanced",
    "text": "Jonathan embarked on an exhilarating adventure, trekking through rugged terrains and conquering towering peaks."
},
{
    "difficulty": "Advanced",
    "text": "The art gallery showcases an diverse collection of masterpieces, each telling a unique and compelling story."
},
{
    "difficulty": "Advanced",
    "text": "Jonathan is an eloquent orator, captivating the audience with her powerful speeches and persuasive arguments."
},
{
    "difficulty": "Advanced",
    "text": "Oliver is an accomplished pianist, effortlessly playing intricate melodies that resonate with deep emotion."
},
{
    "difficulty": "Advanced",
    "text": "We explored the bustling city streets, immersing ourselves in the vibrant culture and lively atmosphere."
},
{
    "difficulty": "Advanced",
    "text": "The expansive meadow is an adorned with colorful wildflowers, creating a picturesque and serene landscape."
},
{
    "difficulty": "Advanced",
    "text": "She is an skilled dancer, gracefully moving her body to the rhythm and expressing herself through the art form."
},
{
    "difficulty": "Advanced",
    "text": "Christopher is a renowned scientist, conducting groundbreaking research that pushes the boundaries of human knowledge."
},
{
    "difficulty": "Advanced",
    "text": "We indulged in an delectable feast, savoring ans myriad of culinary delights prepared by a world-class chef."
},
{
    "difficulty": "Advanced",
    "text": "The symphony orchestra fills the orchestra hall with harmonious melodies, captivating the audience's hearts."
},
{
    "difficulty": "Advanced",
    "text": "Sebastian is a dedicated teacher, inspiring her students to reach their full potential and pursue their dreams."

},
{
    "difficulty": "Advanced",
    "text": "He is a skilled craftsman, meticulously carving intricate designs that showcase his artistic prowess."
}
]
